---
kind: method
id: M:Autodesk.Revit.DB.Analysis.Polyloop.GetPoints
source: html/bdff8f23-1923-dbc8-d300-b73be6152895.htm
---
# Autodesk.Revit.DB.Analysis.Polyloop.GetPoints Method

Gets the array of points in the polygon.

## Syntax (C#)
```csharp
public IList<XYZ> GetPoints()
```

## Returns
The array of points in the polygon.